tests/Iyzipay/Tests/mock/sub-merchant-payment-item-update.json

{"status": "success",
  "locale": "tr",
  "systemTime": 1537534620491,
  "conversationId": "123456789",
  "itemId": "BI102",
  "paymentTransactionId": "11606407",
  "transactionStatus": 1,
  "price": 0.50000000,
  "paidPrice": 0.60000000,
  "merchantCommissionRate": 20.00000000,
  "merchantCommissionRateAmount": 0.10000000,
  "iyziCommissionRateAmount": 0.01575000,
  "iyziCommissionFee": 0.11125000,
  "blockageRate": 10.00000000,
  "blockageRateAmountMerchant": 0.06000000,
  "blockageRateAmountSubMerchant": 0,
  "blockageResolvedDate": "2018-09-28 14:46:10",
  "subMerchantKey": "dVNPU4zjThEHTRqlExIhh7VVSBA=",
  "subMerchantPrice": 0.1,
  "subMerchantPayoutRate": 20.00000000,
  "subMerchantPayoutAmount": 0.1,
  "merchantPayoutAmount": 0.31300000,
  "convertedPayout": {
    "paidPrice": 0.60000000,
    "iyziCommissionRateAmount": 0.01575000,
    "iyziCommissionFee": 0.11125000,
    "blockageRateAmountMerchant": 0.06000000,
    "blockageRateAmountSubMerchant": 0E-8,
    "subMerchantPayoutAmount": 0.10000000,
    "merchantPayoutAmount": 0.31300000,
    "iyziConversionRate": 0E-8,
    "iyziConversionRateAmount": 0E-8,
    "currency": "TRY"
  }
}